tap "d12frosted/emacs-plus"
tap "rafaelgarrido/caveats"

brew "aarch64-elf-gcc" # GNU compiler collection for aarch64-elf
brew "atool" # Archival front-end
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "binutils" # GNU binary tools for native development
brew "brew-caveats" # Formulae Caveats Shortcut for Homebrew Package Manager
brew "btop" # Resource monitor. C++ version and continuation of bashtop and bpytop
brew "cmake" # Cross-platform make
brew "coreutils" # GNU File, Shell, and Text utilities
brew "creduce" # Reduce a C/C++ program while keeping a property of interest
brew "d12frosted/emacs-plus/emacs-plus@31" # GNU Emacs text editor
brew "dust" # More intuitive version of du in rust
brew "eza" # Modern, maintained replacement for ls
brew "fd" # Simple, fast and user-friendly alternative to find
brew "fish" # User-friendly command-line shell for UNIX-like operating systems
brew "fisher" # Plugin manager for the Fish shell
brew "gcc" # GNU compiler collection
brew "gh" # GitHub command-line tool
brew "ghc" # Glorious Glasgow Haskell Compilation System
brew "ghcup" # Installer for the general purpose language Haskell
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "grep" # GNU grep, egrep and fgrep
brew "helix" # Post-modern modal text editor
brew "htop" # Improved top (interactive process viewer)
brew "jj" # Git-compatible distributed version control system
brew "just" # Handy way to save and run project-specific commands
brew "libgccjit" # JIT library for the GNU compiler collection
brew "libtool" # Generic library support script
brew "lld" # LLVM Project Linker
brew "llvm" # Next-gen compiler infrastructure
brew "make" # Utility for directing compilation
brew "neovim" # Ambitious Vim-fork focused on extensibility and agility
brew "ninja" # Small build system for use with gyp or CMake
brew "openssl@3" # Cryptography and SSL/TLS Toolkit
brew "pass" # Password manager
brew "patchelf" # Modify dynamic ELF executables
brew "python@3.13" # Interpreted, interactive, object-oriented programming language
brew "ranger" # File browser
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "rustup" # Rust toolchain installer
brew "stow" # Organize software neatly under a single directory tree (e.g. /usr/local)
brew "tokei" # Program that allows you to count code, quickly
brew "typos-cli" # Source code spell checker
brew "util-linux" # Collection of Linux utilities
brew "watchman" # Watch files and take action when they change
brew "wget" # Internet file retriever

cask "firefox" # Web browser
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-fontawesome"
cask "font-iosevka-nerd-font"
cask "font-iosevka"
cask "font-roboto"
cask "font-source-sans-3"
cask "hammerspoon" # Desktop automation application
cask "hot" # Menu bar application that displays the CPU speed limit due to thermal issues
cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app
cask "spotify" # Music streaming service
cask "thunderbird" # Customizable email client
cask "visual-studio-code" # Open-source code editor

vscode "bodil.file-browser"
vscode "correiagithubgruvbox.correia-github-gruvbox"
vscode "github.copilot-chat"
vscode "github.copilot"
vscode "jacobdufault.fuzzy-search"
vscode "kahole.magit"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mk12.better-git-line-blame"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.remote-explorer"
vscode "nefrob.vscode-just-syntax"
vscode "phantom.gcc-md"
vscode "quarkquartet-irw.doom-solarized"
vscode "rreverser.llvm"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
